# Assignment 3: Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``../../DATA/US_Baby_Names_right.csv'``.

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names =pd.read_csv('DATA/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
del baby_names["Unnamed: 0"]
del baby_names["Id"]
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Are there more male or female names in the dataset?

In [5]:
baby_names["Gender"].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [6]:
names = baby_names.groupby(baby_names["Name"])
names.head()

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1004923  Gryffin  2014      M    WI      5
1004950     Kroy  2014      M    WI      5
1004973     Owyn  2014      M    WI      5
1005707   Haylea  2005      F    WV      5
1012216  Coalton  2012      M    WV      7

[65502 rows x 5 columns]

### Step 8. How many different names exist in the dataset?

In [7]:
print(len(names))

17632

### Step 9. What is the name with most occurrences?

In [8]:
names["Name"].value_counts().sort_values().tail()

Name    Name
Hayden  Hayden    1049
Peyton  Peyton    1064
Jordan  Jordan    1073
Avery   Avery     1080
Riley   Riley     1112
Name: Name, dtype: int64

### Step 10. How many different names have the least occurrences?

In [9]:
least_occurrences = names["Name"].value_counts() == names["Name"].value_counts().min()
least_occurrences.value_counts()

False    13950
True      3682
Name: Name, dtype: int64

### Step 11. What is the median name occurrence?

In [10]:
names["Name"].value_counts().sort_values().median()

8.0

### Step 12. What is the standard deviation of names?

In [11]:
names["Name"].value_counts().std()

122.02996350814125

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [12]:
baby_names.describe(include = "all")

           Name          Year   Gender    State         Count
count   1016395  1.016395e+06  1016395  1016395  1.016395e+06
unique    17632           NaN        2       51           NaN
top       Riley           NaN        F       CA           NaN
freq       1112           NaN   558846    76781           NaN
mean        NaN  2.009053e+03      NaN      NaN  3.485012e+01
std         NaN  3.138293e+00      NaN      NaN  9.739735e+01
min         NaN  2.004000e+03      NaN      NaN  5.000000e+00
25%         NaN  2.006000e+03      NaN      NaN  7.000000e+00
50%         NaN  2.009000e+03      NaN      NaN  1.100000e+01
75%         NaN  2.012000e+03      NaN      NaN  2.600000e+01
max         NaN  2.014000e+03      NaN      NaN  4.167000e+03